<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"staging","backend":"8ea31f61f7cf51239c804541d74cf4820b48dd78b2d6749a41b45b6040fbe3af","plan_job_ref":"Job Pull Request Checks #222 at https://github.com/GSA-TTS/FAC/actions/runs/19890831085","plan_out_hash":"a854ac820446eaff5e4ca14c5f86468e897a03e02f8b8e250e52931306403196","plan_hash":"d475a366ff806d4e4bf24bb567764a2af268ae182a5acb5b0dfbb1497b481911","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan for __staging__
<details>
<summary>Plan: 3 to add, 5 to change, 3 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.staging.cloudfoundry_network_policy.app-network-policy will be updated in-place
!~  resource "cloudfoundry_network_policy" "app-network-policy" {
!~      policies = [
!~          {
!~              destination_app = "4a91393c-ca00-4b6b-b0b9-ff984d98c072" -> (known after apply)
#                (3 unchanged attributes hidden)
            },
!~          {
!~              destination_app = "4a91393c-ca00-4b6b-b0b9-ff984d98c072" -> (known after apply)
#                (3 unchanged attributes hidden)
            },
#            (1 unchanged element hidden)
        ]
    }

  # module.staging.cloudfoundry_network_policy.clamav-network-policy will be updated in-place
!~  resource "cloudfoundry_network_policy" "clamav-network-policy" {
!~      policies = [
!~          {
!~              source_app      = "4a91393c-ca00-4b6b-b0b9-ff984d98c072" -> (known after apply)
#                (3 unchanged attributes hidden)
            },
!~          {
!~              source_app      = "42f4df2b-22ce-44bc-8b1c-81e2dedcdb46" -> (known after apply)
#                (3 unchanged attributes hidden)
            },
        ]
    }

  # module.staging.cloudfoundry_network_policy.scanner-network-policy will be updated in-place
!~  resource "cloudfoundry_network_policy" "scanner-network-policy" {
!~      policies = [
!~          {
!~              destination_app = "42f4df2b-22ce-44bc-8b1c-81e2dedcdb46" -> (known after apply)
#                (3 unchanged attributes hidden)
            },
#            (1 unchanged element hidden)
        ]
    }

  # module.staging.module.clamav.cloudfoundry_app.clamav_api must be replaced
-/+ resource "cloudfoundry_app" "clamav_api" {
+       buildpacks                      = (known after apply)
!~      created_at                      = "2025-10-01T10:47:42Z" -> (known after apply)
!~      docker_image                    = "ghcr.io/gsa-tts/fac/clamav@sha256:cf65d528d34f8b3525fa7653a11b2e9b39cd7454392d8c89e620df857d3adbc3" -> "ghcr.io/gsa-tts/fac/clamav@sha256:3946ec9031115cdbfd6c691b3a6b7a1b2b5f8a7118b5a9f5229f8d6cdf6a68f6"
!~      enable_ssh                      = false -> (known after apply)
!~      health_check_type               = "port" -> (known after apply)
!~      id                              = "************************************" -> (known after apply)
!~      log_rate_limit_per_second       = "-1" -> (known after apply)
        name                            = "fac-av-staging"
!~      readiness_health_check_type     = "process" -> (known after apply)
!~      routes                          = [
-           {
-               protocol = "http1" -> null
-               route    = "fac-av-staging.apps.internal" -> null
            },
        ] -> (known after apply)
+       service_bindings                = (known after apply) # forces replacement
!~      stack                           = null -> (known after apply)
!~      updated_at                      = "2025-10-01T10:47:48Z" -> (known after apply)
#        (8 unchanged attributes hidden)
    }

  # module.staging.module.cors.null_resource.cors_header must be replaced
-/+ resource "null_resource" "cors_header" {
!~      id       = "*******************" -> (known after apply)
!~      triggers = { # forces replacement
!~          "always_run" = "2025-10-01T10:47:17Z" -> (known after apply)
        }
    }

  # module.staging.module.file_scanner_clamav.cloudfoundry_app.clamav_api must be replaced
-/+ resource "cloudfoundry_app" "clamav_api" {
+       buildpacks                      = (known after apply)
!~      created_at                      = "2025-10-01T10:50:01Z" -> (known after apply)
!~      docker_image                    = "ghcr.io/gsa-tts/fac/clamav@sha256:cf65d528d34f8b3525fa7653a11b2e9b39cd7454392d8c89e620df857d3adbc3" -> "ghcr.io/gsa-tts/fac/clamav@sha256:3946ec9031115cdbfd6c691b3a6b7a1b2b5f8a7118b5a9f5229f8d6cdf6a68f6"
!~      enable_ssh                      = false -> (known after apply)
!~      health_check_type               = "port" -> (known after apply)
!~      id                              = "************************************" -> (known after apply)
!~      log_rate_limit_per_second       = "-1" -> (known after apply)
        name                            = "fac-av-staging-fs"
!~      readiness_health_check_type     = "process" -> (known after apply)
!~      routes                          = [
-           {
-               protocol = "http1" -> null
-               route    = "fac-av-staging-fs.apps.internal" -> null
            },
        ] -> (known after apply)
+       service_bindings                = (known after apply) # forces replacement
!~      stack                           = null -> (known after apply)
!~      updated_at                      = "2025-10-01T10:50:08Z" -> (known after apply)
#        (8 unchanged attributes hidden)
    }

  # module.staging.module.clamav.module.route.cloudfoundry_route.app_route will be updated in-place
!~  resource "cloudfoundry_route" "app_route" {
!~      destinations = [
-           {
-               app_id           = "4a91393c-ca00-4b6b-b0b9-ff984d98c072" -> null
-               app_process_type = "web" -> null
-               id               = "64cb1781-33c8-432d-b7aa-eb2af36e5025" -> null
-               port             = 8080 -> null
-               protocol         = "http1" -> null
            },
+           {
+               app_id           = (known after apply)
+               app_process_type = (known after apply)
+               id               = (known after apply)
+               port             = (known after apply)
+               protocol         = (known after apply)
            },
        ]
        id           = "8dec12f0-4f36-4b17-8f5d-f3adfbc29544"
!~      updated_at   = "2025-10-01T10:47:48Z" -> (known after apply)
#        (6 unchanged attributes hidden)
    }

  # module.staging.module.file_scanner_clamav.module.route.cloudfoundry_route.app_route will be updated in-place
!~  resource "cloudfoundry_route" "app_route" {
!~      destinations = [
-           {
-               app_id           = "42f4df2b-22ce-44bc-8b1c-81e2dedcdb46" -> null
-               app_process_type = "web" -> null
-               id               = "02711821-e240-4510-a40b-2cd2a10148ea" -> null
-               port             = 8080 -> null
-               protocol         = "http1" -> null
            },
+           {
+               app_id           = (known after apply)
+               app_process_type = (known after apply)
+               id               = (known after apply)
+               port             = (known after apply)
+               protocol         = (known after apply)
            },
        ]
        id           = "af3d69cb-63a9-4abc-99d1-7b1f8675b4d4"
!~      updated_at   = "2025-10-01T10:50:08Z" -> (known after apply)
#        (6 unchanged attributes hidden)
    }

Plan: 3 to add, 5 to change, 3 to destroy.
```
</details>

:memo: Plan generated in [Pull Request Checks #222](https://github.com/GSA-TTS/FAC/actions/runs/19890831085)